---
kind: method
id: M:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetRequiredFabricationPartTypeIds
source: html/8c8d8fb8-265f-c0b7-3515-2967501827b7.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetRequiredFabricationPartTypeIds Method

Returns set of required fabrication part types in use in routing solution mode.

## Syntax (C#)
```csharp
public ISet<ElementId> GetRequiredFabricationPartTypeIds()
```

## Returns
The set of ElementIds for for required fabrication part types that is in use in routing solution mode.